mooc-ui/SDK15.3-test-in-NRF52840-/examples/ble_peripheral/ble_app_hrs_freertos/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;//广播间隔
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;//广播超时停止代码

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for starting advertising. */
static void advertising_start(void * p_erase_bonds)
{
    bool erase_bonds = *(bool*)p_erase_bonds;

    if (erase_bonds)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}


#if NRF_LOG_ENABLED
/**@brief Thread for handling the logger.
 *
 * @details This thread is responsible for processing log entries if logs are deferred.
 *          Thread flushes all log entries and suspends. It is resumed by idle task hook.
 *
 * @param[in]   arg   Pointer used for passing some arbitrary information (context) from the
 *                    osThreadCreate() call to the thread.
 */
static void logger_thread(void * arg)
{
    UNUSED_PARAMETER(arg);

    while (1)
    {
        NRF_LOG_FLUSH();

        vTaskSuspend(NULL); // Suspend myself
    }
}
#endif //NRF_LOG_ENABLED

/**@brief A function which is hooked to idle task.
 * @note Idle hook must be enabled in FreeRTOS configuration (configUSE_IDLE_HOOK).
 */
void vApplicationIdleHook( void )
{
#if NRF_LOG_ENABLED
     vTaskResume(m_logger_thread);
#endif
}


/**@brief Function for initializing the clock.
 */
static void clock_init(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
}


static void task1(void * p_context){
    while(1){
        bsp_board_led_on(BSP_BOARD_LED_2);
        vTaskDelay(1000);
        bsp_board_led_off(BSP_BOARD_LED_2);
        vTaskDelay(1000);
              
        //NRF_LOG_INFO("i'm task1");
        //pass
    }
}

static void task2(void *p_context){
    
    while(1){
        bsp_board_led_on(BSP_BOARD_LED_3);
        vTaskDelay(1000);
        bsp_board_led_off(BSP_BOARD_LED_3);
        vTaskDelay(1000);
        //NRF_LOG_INFO("i'm task2");
        //pass
    }
}



static void receive_task(void *p_context){
    BaseType_t xReturn = pdTRUE;//定义一个创建信息返回值，默认为pdTRUE
    uint32_t r_queue;//定义一个接受消息的变量
    while(1){
        xReturn = xQueueReceive(Test_Queue, &r_queue, portMAX_DELAY);
        if(pdTRUE == xReturn){
            NRF_LOG_INFO("receive data is %d",r_queue);
            //bsp_board_led_invert(BSP_BOARD_LED_2);
        }else{
            NRF_LOG_INFO("receive data error:0x%x",xReturn);
        }
    }
}


static void send_task(void *p_context){
    BaseType_t xReturn = pdPASS;
    uint32_t send_data1 = 1;
    uint32_t send_data2 = 2;
    static uint8_t count = 4;
    while(1){
        while(count){
            count = count-1;
            xReturn = xQueueSend(Test_Queue, &send_data1, 0);
            if(pdPASS == xReturn){
                NRF_LOG_INFO("message sned ok");
            }else{
                NRF_LOG_INFO("message send failed");
            }
            vTaskDelay(1000);  
        }        
    }
}


/*
任务的几种状态:
           挂起状态
         *         *
        /  \         \
            *
      就绪态 <-->  运行状态
         *
          \       /
                 *
           阻塞状态

*/

static void queue_init(void){
    Test_Queue = xQueueCreate((UBaseType_t ) QUEUE_LEN,/* 消息队列的长度 */
    (UBaseType_t ) QUEUE_SIZE);/* 消息的大小 */
    if (NULL != Test_Queue)
    NRF_LOG_INFO("create Test_Queue ok!");  
}

static void task_create_func(){   
    #if NRF_LOG_ENABLED
        // Start execution.
        if (pdPASS != xTaskCreate(logger_thread, "LOGGER", 256, NULL, 1, &m_logger_thread))
        {
            APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
        }
    #endif 

    queue_init();//create queue
    
    if(pdPASS != xTaskCreate(task1, "TASK1", configMINIMAL_STACK_SIZE+30, NULL, 2, &m_task1_thread))
    {
        NRF_LOG_INFO("create task1 error");
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
    if(pdPASS != xTaskCreate(task2, "TASK2", configMINIMAL_STACK_SIZE+10, NULL, 2, &m_task2_thread))
    {
        NRF_LOG_INFO("create task2 error");
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }     
    if(pdPASS != xTaskCreate(send_task, "send_task", configMINIMAL_STACK_SIZE+10, NULL, 2, &m_receive_task_thread))
    {
        NRF_LOG_INFO("create m_receive_task_thread error");
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }     
    if(pdPASS != xTaskCreate(receive_task, "receive_task", configMINIMAL_STACK_SIZE+10, NULL, 2, &m_send_task_thread))
    {
        NRF_LOG_INFO("create receive_task error");
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }    

}


/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize modules.
    log_init();
    clock_init();

    // Do not start any interrupt that uses system functions before system initialisation.
    // The best solution is to start the OS before any other initalisation.

    // Activate deep sleep mode.
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

    // Configure and initialize the BLE stack.
    ble_stack_init();

    // Initialize modules.
    timers_init();
    buttons_leds_init(&erase_bonds);
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    peer_manager_init();
    //application_timers_start();
    
    task_create_func();

    // Create a FreeRTOS task for the BLE stack.
    // The task will run advertising_start() before entering its loop.
    nrf_sdh_freertos_init(advertising_start, &erase_bonds);

    NRF_LOG_INFO("HRS FreeRTOS example started.");       
    
    // Start FreeRTOS scheduler.
    vTaskStartScheduler();

    for (;;)
    {
        APP_ERROR_HANDLER(NRF_ERROR_FORBIDDEN);
    }
}

/*
@renfence:https://github.com/lee35210/nRF52840_BLE_FREERTOS_MLX90614/blob/master/main.c
*/


